Revit 2027 API
ExternalDefinition.OwnerGroup Property
 Returns or change the group ID of the external parameter definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DefinitionGroup OwnerGroup { get; set; }
Public Overridable Property OwnerGroup As DefinitionGroup
	Get
	Set
public:
virtual property DefinitionGroup^ OwnerGroup {
	DefinitionGroup^ get ();
	void set (DefinitionGroup^ value);
}
abstract OwnerGroup : DefinitionGroup with get, set
override OwnerGroup : DefinitionGroup with get, set
Property Value
DefinitionGroup
Remarks
 If failed When set the group, an InvalidOperationException will be thrown.
See Also
Reference
ExternalDefinition Class
Autodesk.Revit.DB Namespace